#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_resource_group.logging_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.app_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg][0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-function-nsg001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-function-vnet001][0m
[0m[1mazurerm_monitor_private_link_scope.mpls: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Insights/privateLinkScopes/myfunc-dev-ampls001][0m
[0m[1mazurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/myfunc-dev-log001][0m
[0m[1mazurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Web/serverfarms/myfunc-dev-asp001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/myfunc-dev-vault001][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-function-rt001][0m
[0m[1mazapi_resource.subnet_function: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-function-vnet001/subnets/FunctionSubnet][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/myfunc-dev-vault001/providers/Microsoft.Authorization/roleAssignments/ee0c54e7-f69a-0c60-8af8-855b820d5af2][0m
[0m[1mazurerm_monitor_private_link_scoped_service.mpls_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Insights/privateLinkScopes/myfunc-dev-ampls001/scopedResources/ampls-myfunc-dev-log001][0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Insights/components/myfunc-dev-appi001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/myfunc-dev-vault001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/myfunc-dev-log001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/myfunc-dev-log001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Web/serverfarms/myfunc-dev-asp001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Web/serverfarms/myfunc-dev-asp001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazurerm_monitor_private_link_scoped_service.mpls_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Insights/privateLinkScopes/myfunc-dev-ampls001/scopedResources/ampls-myfunc-dev-appi001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Insights/components/myfunc-dev-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Insights/components/myfunc-dev-appi001|logAnalytics][0m
[0m[1mazapi_resource.storage_file_share: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001/fileServices/default/shares/logicapp][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001|logAnalytics][0m
[0m[1mazurerm_storage_management_policy.storage_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001/managementPolicies/default][0m
[0m[1mazapi_resource.subnet_services: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-function-vnet001/subnets/PeSubnet][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/myfuncdevstg001-queue-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_table: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/myfuncdevstg001-table-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/myfuncdevstg001-blob-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_file: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/myfuncdevstg001-file-pe][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/myfunc-dev-vault001-pe][0m
[0m[1mazurerm_private_endpoint.mpls_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.Network/privateEndpoints/myfunc-dev-ampls001-pe][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_sample: Refreshing state... [id=https://myfunc-dev-vault001.vault.azure.net/secrets/MySampleSecret/fb47dff75e5c4db5b89a04e56f5c0fb1][0m
[0m[1mazapi_resource.function: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Web/sites/myfunc-dev-fctn001][0m
[0m[1mazurerm_role_assignment.function_role_assignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/myfunc-dev-vault001/providers/Microsoft.Authorization/roleAssignments/22295261-7a69-38d2-7653-1ac560925cd5][0m
[0m[1mazurerm_private_endpoint.function_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/myfunc-dev-fctn001-pe][0m
[0m[1mazurerm_role_assignment.function_role_assignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001/providers/Microsoft.Authorization/roleAssignments/b93591fa-c2c8-b793-4f71-3ed3a77316ac][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_function: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Web/sites/myfunc-dev-fctn001|logAnalytics][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # azapi_resource.function[0m has been deleted
[0m  [31m-[0m[0m resource "azapi_resource" "function" {
      [31m-[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Web/sites/myfunc-dev-fctn001" [90m-> null[0m[0m
      [31m-[0m[0m name                      = "myfunc-dev-fctn001" [90m-> null[0m[0m
        tags                      = {}
        [90m# (9 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m identity {
          [31m-[0m[0m principal_id = "6bde7e42-ab1e-463b-aef1-c6e690f6f171" [90m-> null[0m[0m
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_key_vault.key_vault[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_key_vault" "key_vault" {
      [31m-[0m[0m id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/myfunc-dev-vault001" [90m-> null[0m[0m
      [31m-[0m[0m name                            = "myfunc-dev-vault001" [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name             = "myfunc-dev-app-rg" [90m-> null[0m[0m
        tags                            = {}
      [31m-[0m[0m vault_uri                       = "https://myfunc-dev-vault001.vault.azure.net/" [90m-> null[0m[0m
        [90m# (11 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_sample[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_sample" {
      [31m-[0m[0m id                      = "https://myfunc-dev-vault001.vault.azure.net/secrets/MySampleSecret/fb47dff75e5c4db5b89a04e56f5c0fb1" [90m-> null[0m[0m
        name                    = "MySampleSecret"
        tags                    = {}
        [90m# (7 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_function[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_function" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001"
    }

[1m  # azapi_resource.function[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "function" {
      [32m+[0m[0m body                      = (sensitive value)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m name                      = "myfunc-dev-fctn001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Web/sites@2022-09-01"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "myfunc-dev-vault001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "myfunc-dev-app-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_sample[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_sample" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "MySampleSecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_function[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_function" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/myfunc-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/myfunc-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_storage[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_storage" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Capacity" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 30 [90m-> null[0m[0m
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Transaction" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 30 [90m-> null[0m[0m
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_private_endpoint.function_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "function_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "myfunc-dev-fctn001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "myfunc-dev-fctn001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "myfunc-dev-app-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-function-vnet001/subnets/PeSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "myfunc-dev-fctn001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "myfunc-dev-fctn001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_private_endpoint.key_vault_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "myfunc-dev-vault001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "myfunc-dev-vault001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "myfunc-dev-app-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-function-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-function-vnet001/subnets/PeSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "myfunc-dev-vault001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "myfunc-dev-vault001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # azurerm_role_assignment.current_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.function_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "function_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets Officer"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.function_role_assignment_storage[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "function_role_assignment_storage" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001/providers/Microsoft.Authorization/roleAssignments/b93591fa-c2c8-b793-4f71-3ed3a77316ac" -> (known after apply)
      [33m~[0m[0m name                             = "b93591fa-c2c8-b793-4f71-3ed3a77316ac" -> (known after apply)
      [33m~[0m[0m principal_id                     = "6bde7e42-ab1e-463b-aef1-c6e690f6f171" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_storage_account.storage[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "storage" {
        id                                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/myfuncdevstg001"
        name                              = "myfuncdevstg001"
      [33m~[0m[0m shared_access_key_enabled         = true [33m->[0m[0m false
        tags                              = {}
        [90m# (38 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
            [90m# (4 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Security/datascanners/storageDataScanner" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 10 to add, 2 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>